src/DataProcessors/ИмпортСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИмпортСправочников</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ТаблицаСоответсвийПолей</Name>
				</Properties>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Актуальность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРегистратор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеЗапасов</v8:Type>
						<v8:Type>cfg:DocumentRef.Поступление</v8:Type>
						<v8:Type>cfg:DocumentRef.НарядЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВремяОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДеньНедели</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПартииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПартииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/МестонахождениеМедицинскихКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МестонахождениеМедицинскихКарт</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Местоположение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Местоположения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/МеткиКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МеткиКлиентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СистемыНалогообложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СистемыНалогообложения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Упрощенная</Name>
					<Comment>Упрощенная </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Общая</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ЮрФизЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЮрФизЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮрЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПечатныеФормыМедицинскихКарт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПечатныеФормыМедицинскихКарт</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АмбулаторнаяКарта_043_У_А4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмбулаторнаяКарта_043_У_А5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскаяКарта_025У_04_А4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскаяКарта_025У_04_А5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскаяКарта_025У_14</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмбулаторнаяКарта_043_У_СССР_А4</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АмбулаторнаяКарта_043_У_СССР_А5</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МедицинскаяКартаОртодонтическогоПациента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/DataProcessors/ИмпортСправочников/Forms/Форма/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Процесс подготовкм к импорту

&НаКлиенте
// Процедура - обработчик события "ПриОткрытии"
//
Процедура ПриОткрытии(Отказ)
	
	ФлагРазрешенияИмпорта = Ложь;
	СимволРазделитель = ";";
	ЗагружаемыйСправочник = "Пациенты";
	ВыбратьСправочник();
	ЗаполнитьТаблицуСоответствий();

КонецПроцедуры

&НаКлиенте
// Обработчик события выбора заполняемого справочника
// 
Процедура ВыборСправочникаПриИзменении(Элемент)	
	
	ВыбратьСправочник();
	ЗаполнитьТаблицуСоответствий();
	
КонецПроцедуры

&НаСервере
// Выбрать заполняемый справочник
//
Процедура ВыбратьСправочник()
	
	Объект.ТаблицаСоответсвийПолей.Очистить();
	Элементы.Декорация1.Заголовок = "";
	
	Если ЗагружаемыйСправочник = "Номенклатура" Тогда
		
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНастройкиЗагрузкиНоменклатуры;
		
		ВыборПапкиСправочника = Справочники.Номенклатура.ПустаяСсылка();
		// заполняем список наименований реквизитов заполняемого справочника
		СписокРеквизитовСправочника.Очистить();
		СписокРеквизитовСправочника.Добавить("Наименование");
		СписокРеквизитовСправочника.Добавить("Группа");
		СписокРеквизитовСправочника.Добавить("Артикул");
		СписокРеквизитовСправочника.Добавить("Цена");
		СписокРеквизитовСправочника.Добавить("Штрихкод");
		СписокРеквизитовСправочника.Добавить("Комментарий");
		СписокРеквизитовСправочника.Добавить("Норма времени");
		СписокРеквизитовСправочника.Добавить("Упаковка по умолчанию");
		СписокРеквизитовСправочника.Добавить("Коэффициент упаковки по умолчанию");
		СписокРеквизитовСправочника.Добавить("Цена за упаковку по умолчанию");
	Иначе	                          
		
		Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаНастройкиЗагрузкиКлиентов;
		
		ВыборПапкиСправочника = Справочники.Контрагенты.ПустаяСсылка();
		// заполняем список наименований реквизитов заполняемого справочника
		СписокРеквизитовСправочника.Очистить();
		СписокРеквизитовСправочника.Добавить("Номер амбулаторной карты");
		СписокРеквизитовСправочника.Добавить("Группа");
		СписокРеквизитовСправочника.Добавить("ФИО");
		СписокРеквизитовСправочника.Добавить("Фамилия");
		СписокРеквизитовСправочника.Добавить("Имя");
		СписокРеквизитовСправочника.Добавить("Отчество");
		СписокРеквизитовСправочника.Добавить("Дата рождения");
		СписокРеквизитовСправочника.Добавить("Дата регистрации");
		СписокРеквизитовСправочника.Добавить("Пол");
		СписокРеквизитовСправочника.Добавить("Адрес");
		СписокРеквизитовСправочника.Добавить("Телефон");
		СписокРеквизитовСправочника.Добавить("Email");
		СписокРеквизитовСправочника.Добавить("Комментарий");
		СписокРеквизитовСправочника.Добавить("Серия полиса");
		СписокРеквизитовСправочника.Добавить("Номер полиса");
		СписокРеквизитовСправочника.Добавить("Начало действия полиса");
		СписокРеквизитовСправочника.Добавить("Конец действия полиса");
		СписокРеквизитовСправочника.Добавить("Код синхронизации"); 
		СписокРеквизитовСправочника.Добавить("Метки *");
		
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении" поля "ПоискПоТипу".
//
Процедура ПоискПоТипуПриИзменении(Элемент)
	
	ЗаполнитьТаблицуСоответствий();
	
КонецПроцедуры

&НаКлиенте
// Заполнение колонок таблицы соответствий,колонка реквизиты справочника
//
Процедура ЗаполнитьТаблицуСоответствий()
	
	Объект.ТаблицаСоответсвийПолей.Очистить();
	
	ИндексЗначения = 0;
	Пока ИндексЗначения < СписокРеквизитовСправочника.Количество() Цикл		
		Строка = Объект.ТаблицаСоответсвийПолей.Добавить();
		Строка.РеквизитСправочника = СписокРеквизитовСправочника[ИндексЗначения].Значение;
		Если ПоискПоТипу = 1 И СписокРеквизитовСправочника[ИндексЗначения].Значение = "Наименование" Тогда 
			Строка.ОтметкаНезаполненного = Истина;
		ИначеЕсли ПоискПоТипу = 3 И СписокРеквизитовСправочника[ИндексЗначения].Значение = "Артикул" Тогда		
			Строка.ОтметкаНезаполненного = Истина;
		Иначе 
			Строка.ОтметкаНезаполненного = Ложь;
		КонецЕсли;			
		ИндексЗначения = ИндексЗначения + 1;
	КонецЦикла;
	
	ФлагРазрешенияИмпорта = Истина;
	
КонецПроцедуры	

&НаКлиенте
// Процедура - обработчик события "НачалоВыбора"
//
Процедура ВыборФайлаИмпортаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыборФайла(Элемент);
		
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события "ПриИзменении"
//
Процедура ВыборФайлаИмпортаПриИзменении(Элемент)
	
	ЧитаемыйФайл = Новый Файл(ФайлИмпорта);
	
	ЧитаемыйФайл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ВыборФайлаИмпортаПослеПроверки", ЭтотОбъект, Новый Структура("ЧитаемыйФайл", ЧитаемыйФайл)));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаИмпортаПослеПроверки(ПроверкаПройдена, ДополнительныеПараметры) Экспорт
	
	ЧитаемыйФайл = ДополнительныеПараметры.ЧитаемыйФайл;
	
	Если НЕ ПроверкаПройдена И НЕ ДополнительныеПараметры.Свойство("ПроверкаНаКаталогЗавершилась")
		//Если каталог
		ИЛИ ПроверкаПройдена И ДополнительныеПараметры.Свойство("ПроверкаНаКаталогЗавершилась") Тогда
		ПоказатьПредупреждение(,"Выберите файл загрузки."); 
	ИначеЕсли НЕ ДополнительныеПараметры.Свойство("ПроверкаНаКаталогЗавершилась") Тогда
		ЧитаемыйФайл.НачатьПроверкуЭтоКаталог(Новый ОписаниеОповещения("ВыборФайлаИмпортаПослеПроверки", ЭтотОбъект, Новый Структура("ЧитаемыйФайл, ПроверкаНаКаталогЗавершилась", ЧитаемыйФайл, Истина)));
		Возврат;
	Иначе
		ВыборФайлаИмпортаПриИзмененииЗавершение(ЧитаемыйФайл);
	КонецЕсли; 
	
КонецПроцедуры  

&НаКлиенте
Процедура ВыборФайлаИмпортаПриИзмененииЗавершение(ЧитаемыйФайл)
	
	Расширение = нРег(ЧитаемыйФайл.Расширение);
	
	Если нРег(Расширение) = ".xls" ИЛИ нРег(Расширение) = ".xlsx" Тогда
		
		ТипФайлаИмпорта = "EXCEL";
		элементы.СимволРазделитель.Видимость = Ложь;
	ИначеЕсли нРег(Расширение) = ".csv" Тогда
		
		ТипФайлаИмпорта = "TEXT";	
		элементы.СимволРазделитель.Видимость = Истина;
	КонецЕсли;
	
	Если ПолучитьПоляФайла() = Истина Тогда
		Элементы.ТаблицаСоответствияПолейПолеКолФайла.СписокВыбора.ЗагрузитьЗначения(СписокКолонокФайла.ВыгрузитьЗначения());
		// ЗаполнитьТаблицуСоответствий();
	Иначе 
		ПоказатьПредупреждение(,"Оперция прервана импорт не возможен !");
		Элементы.Декорация1.Заголовок = "";
	КонецЕсли;	
	
	Элементы.Декорация1.Заголовок = ФайлИмпорта;

КонецПроцедуры

&НаКлиенте
// Открывает диалог выбора файла
//
Процедура ВыборФайла(Элемент)	
	
	ДиалогВыбораФайла =	Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр = "Файл импорта (*.csv;*.xls;*.xlsx)|*.csv;*.xls;*.xlsx";
	
	ДиалогВыбораФайла.Заголовок						=	"Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр		=	Ложь;
	ДиалогВыбораФайла.ИндексФильтра					=	0;
	ДиалогВыбораФайла.ПолноеИмяФайла				=	ФайлИмпорта;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла	=	Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект, Новый Структура("ДиалогВыбораФайла, Элемент", ДиалогВыбораФайла, Элемент));

	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогВыбораФайла = ДополнительныеПараметры.ДиалогВыбораФайла;
	Элемент = ДополнительныеПараметры.Элемент;

	Если (ВыбранныеФайлы <> Неопределено) Тогда
		ФайлИмпорта = ДиалогВыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
	
	ВыборФайлаИмпортаПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
//
//
Процедура СимволРазделительПриИзменении(Элемент)
	
	Если ПолучитьПоляФайла()=Истина Тогда
		Элементы.ТаблицаСоответствияПолейПолеКолФайла.СписокВыбора.ЗагрузитьЗначения(СписокКолонокФайла.ВыгрузитьЗначения());
		ЗаполнитьТаблицуСоответствий();
	Иначе 
		ПоказатьПредупреждение(,"Оперция прервана импорт не возможен !");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Создаем и заполняем новый элемент справочника
//
Процедура ЗаполнитьРеквизитыСправочника(СтруктураРеквизитов, ИсходнаяСтрокаДанных, ВидМедицинскихКарт, СтруктураТелефонногоНомера = Неопределено)
	
	Если СтруктураРеквизитов.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ненайдено соответствий наименований реквизитов и полей файла");
		Возврат;
	КонецЕсли;		 
	
	Попытка		

		
		Если ЗагружаемыйСправочник = "Номенклатура" Тогда
			
#Область _____________________________________________________СОЗДАНИЕ_ОБЪЕКТА_СПРАВОЧНИКА_НОМЕНКЛАТУРА_____________________________________________________________		
			
			// Получаем значения реквизитов
			Наименование 					= ВернутьЗначениеРевизита("Наименование",	СтруктураРеквизитов);
			Артикул 						= ВернутьЗначениеРевизита("Артикул",		СтруктураРеквизитов);
			Цена 							= ВернутьЗначениеРевизита("Цена",			СтруктураРеквизитов);
			Штрихкод 						= ВернутьЗначениеРевизита("Штрихкод",		СтруктураРеквизитов);
			Комментарий 					= ВернутьЗначениеРевизита("Комментарий",	СтруктураРеквизитов);
			НормаВремени 	 				= ВернутьЗначениеРевизита("НормаВремени", СтруктураРеквизитов);
			УпаковкаПоУмолчанию 			= ВернутьЗначениеРевизита("УпаковкаПоУмолчанию", СтруктураРеквизитов);
			КоэффициентУпаковкиПоУмолчанию 	= ВернутьЗначениеРевизита("КоэффициентУпаковкиПоУмолчанию", СтруктураРеквизитов);
			ЦенаЗаУпаковкуПоУмолчанию		= ВернутьЗначениеРевизита("ЦенаЗаУпаковкуПоУмолчанию", СтруктураРеквизитов);
			
			//// Ищем существование номеклатуры
			// СсылкаНомеклатуры = Справочники.Номенклатура.НайтиПоНаименованию(Наименование, Истина, ВыборПапкиСправочника);
			
			// Определяем существование номеклатуры.
			Если ПоискПоТипу = 1 Тогда
				СсылкаНомеклатуры = Справочники.Номенклатура.НайтиПоНаименованию(Наименование, Истина);
				// ИначеЕсли ПоискПоТипу = 2 Тогда
				//	ЗаписьШтрихкода = РегистрыСведений.Штрихкоды.ПолучитьДанныеПоШтрихкодам(Штрихкод);
				//	Если ЗаписьШтрихкода.Свойство("Объект") Тогда
				//		СсылкаНомеклатуры = ЗаписьШтрихкода.Объект;
				//	Иначе
				//		СсылкаНомеклатуры = Справочники.Номенклатура.ПустаяСсылка();
				//	КонецЕсли;
			ИначеЕсли ПоискПоТипу = 3 Тогда
				Если НЕ ПустаяСтрока(Артикул) Тогда
					СсылкаНомеклатуры = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул", Артикул);
				Иначе
					СсылкаНомеклатуры = Справочники.Номенклатура.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
			
			Если СсылкаНомеклатуры = Справочники.Номенклатура.ПустаяСсылка() Тогда
				
				НовыйЭлемент = Справочники.Номенклатура.СоздатьЭлемент();
				НовыйЭлемент.Родитель 				= ВыборПапкиСправочника;  
				НовыйЭлемент.Наименование 			= Наименование;
				НовыйЭлемент.НаименованиеПолное 	= Наименование;
				НовыйЭлемент.ТипНоменклатуры 		= ВыборПапкиСправочника.ТипНоменклатуры;
				НовыйЭлемент.Комментарий 			= Комментарий;
			Иначе
				НовыйЭлемент = СсылкаНомеклатуры.ПолучитьОбъект();
			КонецЕсли;
			
			Если Артикул <> Неопределено Тогда
				НовыйЭлемент.Артикул = Артикул;
			КонецЕсли;
			
			НовыйЭлемент.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.шт;
			
			Если  ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация.СистемаНалогообложения = Перечисления.СистемыНалогообложения.Общая Тогда					
				НовыйЭлемент.СтавкаНДС = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница.Организация.СтавкаНДС;					
			Иначе					
				НовыйЭлемент.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;			
			КонецЕсли;		
			НовыйЭлемент.НормаВремени =  НормаВремени;
			НовыйЭлемент.Записать();
			// Запись упаковки номеклатуры.
			Если ?(ЗначениеЗаполнено(КоэффициентУпаковкиПоУмолчанию), КоэффициентУпаковкиПоУмолчанию <> "0", Ложь) И ?(ЗначениеЗаполнено(УпаковкаПоУмолчанию), УпаковкаПоУмолчанию <> "", Ложь) Тогда
				НоваяУпаковкаПоУмолчанию = Справочники.УпаковкиНоменклатуры.СоздатьЭлемент();
				НоваяУпаковкаПоУмолчанию.Наименование = УпаковкаПоУмолчанию;
				НоваяУпаковкаПоУмолчанию.Владелец = НовыйЭлемент.Ссылка;
				НоваяУпаковкаПоУмолчанию.Коэффициент = ?(КоэффициентУпаковкиПоУмолчанию <> "", КоэффициентУпаковкиПоУмолчанию, 1); 
				НоваяУпаковкаПоУмолчанию.Записать();
				НовыйЭлемент.УпаковкаПоУмолчанию = НоваяУпаковкаПоУмолчанию.Ссылка;
				// Запись цены за упаковку
				Если ЦенаЗаУпаковкуПоУмолчанию <> Неопределено  Тогда
					НоваяЦена = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
					НоваяЦена.Автор = ПараметрыСеанса.ТекущийПользователь;	
					НоваяЦена.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
					НоваяЦена.ВидЦен = НомеклатураТипЦен;
					НоваяЦена.Номенклатура = НовыйЭлемент.Ссылка;
					НоваяЦена.Цена = ?(ТипЗнч(ЦенаЗаУпаковкуПоУмолчанию) = Тип("Строка"), СтрЗаменить(ЦенаЗаУпаковкуПоУмолчанию, " ", ""), ЦенаЗаУпаковкуПоУмолчанию);				
					НоваяЦена.Упаковка = НоваяУпаковкаПоУмолчанию.Ссылка;
					НоваяЦена.Период = ТекущаяДата();
					НоваяЦена.Записать();
				КонецЕсли;           
			КонецЕсли;
			НовыйЭлемент.Записать();
			
			// запись цены номеклатуры	
			Если Цена <> Неопределено Тогда						  		 
				НоваяЦена = РегистрыСведений.ЦеныНоменклатуры.СоздатьМенеджерЗаписи();
				НоваяЦена.Автор 				= ПараметрыСеанса.ТекущийПользователь;	
				НоваяЦена.СтруктурнаяЕдиница 	= ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
				НоваяЦена.ВидЦен 				= НомеклатураТипЦен;
				НоваяЦена.Номенклатура 			= НовыйЭлемент.Ссылка;
				НоваяЦена.Цена = ?(ТипЗнч(Цена) = Тип("Строка"), СтрЗаменить(Цена, " ", ""), Цена);				
				// НоваяЦена.Цена 				= Цена;
				НоваяЦена.Период 				= ТекущаяДата();
				НоваяЦена.Записать();						  
			КонецЕсли;
			
			// Запись штрихкода
			Если Штрихкод <> Неопределено Тогда						  
				НовыйШтрихКод = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
				НовыйШтрихКод.Объект 	= НовыйЭлемент.Ссылка;
				НовыйШтрихКод.Период 	= ТекущаяДата();
				НовыйШтрихКод.Штрихкод 	= Штрихкод;
				НовыйШтрихКод.Записать();
			КонецЕсли;	   
			
#КонецОбласти

		Иначе 
			
#Область _____________________________________________________СОЗДАНИЕ_ОБЪЕКТА_СПРАВОЧНИКА_КОНТРАГЕНТЫ______________________________________________________________		



			// Получаем значения реквизитов
			НомерАмбулаторнойКарты 	= ВернутьЗначениеРевизита("Номер амбулаторной карты", СтруктураРеквизитов);
			ФИО 					= ВернутьЗначениеРевизита("ФИО"						, СтруктураРеквизитов);
			Фамилия 				= ВернутьЗначениеРевизита("Фамилия"					, СтруктураРеквизитов);
			Имя 					= ВернутьЗначениеРевизита("Имя"						, СтруктураРеквизитов);
			Отчество 				= ВернутьЗначениеРевизита("Отчество"				, СтруктураРеквизитов);
			ДатаРождения 			= ВернутьЗначениеРевизита("Дата рождения"			, СтруктураРеквизитов);
			Пол 					= ВернутьЗначениеРевизита("Пол"						, СтруктураРеквизитов);
			Адрес 					= ВернутьЗначениеРевизита("Адрес"					, СтруктураРеквизитов);
			Телефон 				= ВернутьЗначениеРевизита("Телефон"					, СтруктураРеквизитов);
			Email 					= ВернутьЗначениеРевизита("Email"					, СтруктураРеквизитов);
			Комментарий 			= ВернутьЗначениеРевизита("Комментарий"				, СтруктураРеквизитов);
			СерияПолиса 			= ВернутьЗначениеРевизита("Серия полиса"			, СтруктураРеквизитов);
			НомерПолиса 			= ВернутьЗначениеРевизита("Номер полиса"			, СтруктураРеквизитов);
			НачалоДействияПолиса 	= ВернутьЗначениеРевизита("Начало действия полиса"	, СтруктураРеквизитов);
			КонецДействияПолиса 	= ВернутьЗначениеРевизита("Конец действия полиса"	, СтруктураРеквизитов);			
			КодСинхронизации 		= ВернутьЗначениеРевизита("Код синхронизации"		, СтруктураРеквизитов);
			ДатаРегистрации 		= ВернутьЗначениеРевизита("Дата регистрации"		, СтруктураРеквизитов);
			Метки 					= ВернутьЗначениеРевизита("Метки"					, СтруктураРеквизитов);
			
#Область ___________________________________________________________ПОЛУЧИМ_ПРЕДСТАВЛЕНИЕ_КЛИЕНТА__________________________________________________________________
			
			Если ЗначениеЗаполнено(ФИО) Тогда 
				СтруктураИнициалов = ВернутьСтруктуруИнициалов(ФИО);
				Фамилия 				= СтруктураИнициалов.Фамилия;
				Имя 					= СтруктураИнициалов.Имя;
				Отчество 				= СтруктураИнициалов.Отчество;
			Иначе 
				Фамилия 				= ?(Фамилия 	= Неопределено, "", Фамилия);
				Имя 					= ?(Имя 		= Неопределено, "", Имя);
				Отчество 				= ?(Отчество 	= Неопределено, "", Отчество);
			КонецЕсли;
			Представление 			= СокрЛП(Фамилия + " " + Имя + " " + Отчество);
			
#КонецОбласти
			
			
#Область ______________________________________________________________ОБРАБОТКА_ДАТЫ_РОЖДЕНИЯ_____________________________________________________________________

			Если ЗначениеЗаполнено(ДатаРождения) Тогда				
				ДатаР = ПривестиКТипуДата(СокрЛП(ДатаРождения));
				Если ДатаР <> Неопределено Тогда					
					ДатаРождения = ДатаР;					         
				Иначе
					ДатаРождения = Неопределено;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неудалось привести к типу Дата. Строка: " + ИсходнаяСтрокаДанных);		
				КонецЕсли;
			Иначе
				ДатаРождения = Неопределено;
			КонецЕсли;
			
#КонецОбласти

#Область ______________________________________________________________ОБРАБОТКА_ДАТЫ_РЕГИСТРАЦИИ_____________________________________________________________________

			Если ЗначениеЗаполнено(ДатаРегистрации) Тогда				
				ДатаР = ПривестиКТипуДата(СокрЛП(ДатаРегистрации));
				Если ДатаР <> Неопределено Тогда					
					ДатаРегистрации = ДатаР;					         
				Иначе
					ДатаРегистрации = Неопределено;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неудалось привести к типу Дата. Строка: " + ИсходнаяСтрокаДанных);		
				КонецЕсли;
			Иначе
				ДатаРегистрации = Неопределено;
			КонецЕсли;
			
#КонецОбласти

#Область ___________________________________________________________________ПОИСК_КЛИЕНТА__________________________________________________________________________

			// Ищем не существует ли такой клиент
			
			СправочникСсылка = Справочники.Контрагенты.ПустаяСсылка();
			Если ЗначениеЗаполнено(КодСинхронизации) Тогда
				
				Попытка
					СправочникСсылка = Справочники.Контрагенты.НайтиПоРеквизиту("КодСинхронизации", Число(КодСинхронизации));		
				Исключение
					СправочникСсылка = Справочники.Контрагенты.ПустаяСсылка();
				КонецПопытки;
				
			КонецЕсли;
			
			
			Если НЕ СправочникСсылка.Пустая() Тогда
				
				НовыйЭлемент = СправочникСсылка;
				
			Иначе
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Контрагенты.Ссылка КАК КлиентСсылка,
				|	Контрагенты.Телефон КАК Телефон
				|ИЗ
				|	Справочник.Контрагенты КАК Контрагенты
				|ГДЕ
				|	Контрагенты.Наименование ПОДОБНО &Представление
				|	И ВЫБОР
				|			КОГДА НЕ Контрагенты.ДатаРожденияКлиента = ДАТАВРЕМЯ(1, 1, 1)
				|				ТОГДА ВЫБОР
				|						КОГДА НЕ &ДатаРожденияКлиента = НЕОПРЕДЕЛЕНО
				|							ТОГДА Контрагенты.ДатаРожденияКлиента = &ДатаРожденияКлиента
				|						ИНАЧЕ ИСТИНА
				|					КОНЕЦ
				|			ИНАЧЕ ИСТИНА
				|		КОНЕЦ
				|	И Контрагенты.ЮрФизЛицо = ЗНАЧЕНИЕ(Перечисление.ЮрФизЛицо.ФизЛицо)
				|	И НЕ Контрагенты.ПометкаУдаления";
				
				Запрос.УстановитьПараметр("Представление", Представление+"%");
				Запрос.УстановитьПараметр("ДатаРожденияКлиента", ДатаРождения);
								
				ТаблицаКлиентов = Запрос.Выполнить().Выгрузить();			
				
				Если ТаблицаКлиентов.Количество() = 0 Тогда
					НовыйЭлемент = Справочники.Контрагенты.ПустаяСсылка();
				ИначеЕсли ТаблицаКлиентов.Количество() = 1 Тогда 
					Если ЗначениеЗаполнено(Телефон) И ЗначениеЗаполнено(ТаблицаКлиентов[0].Телефон) Тогда 
						Если СравнитьТелефоны(Телефон, ТаблицаКлиентов[0].Телефон) Тогда 
							НовыйЭлемент = ТаблицаКлиентов[0].КлиентСсылка;
						Иначе 
							НовыйЭлемент = Справочники.Контрагенты.ПустаяСсылка();
						КонецЕсли;	
					Иначе 
						НовыйЭлемент = ТаблицаКлиентов[0].КлиентСсылка;
					КонецЕсли;
				Иначе 	
					Если ЗначениеЗаполнено(Телефон) Тогда
						НовыйЭлемент = Справочники.Контрагенты.ПустаяСсылка();
						МассивКлиентовСНезаполненнымТелефоном = Новый Массив;
						Для Каждого СтрокаТаблицы Из ТаблицаКлиентов Цикл 
							Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.Телефон) Тогда
								МассивКлиентовСНезаполненнымТелефоном.Добавить(СтрокаТаблицы.КлиентСсылка);
								Продолжить;
							Иначе 
								Если СравнитьТелефоны(Телефон, СтрокаТаблицы.Телефон) Тогда 
									НовыйЭлемент = СтрокаТаблицы.КлиентСсылка;
									Прервать;
								КонецЕсли;	
							КонецЕсли;
						КонецЦикла;
						Если НовыйЭлемент.Пустая() И МассивКлиентовСНезаполненнымТелефоном.Количество() > 0 Тогда 
							НовыйЭлемент = МассивКлиентовСНезаполненнымТелефоном[0].КлиентСсылка;
						КонецЕсли;				
					Иначе 
						НовыйЭлемент = ТаблицаКлиентов[0].КлиентСсылка;
					КонецЕсли;	
				КонецЕсли;	
				
			КонецЕсли;					
			
#КонецОбласти


			Если НовыйЭлемент.Пустая() Тогда							
				
				НовыйЭлемент = Справочники.Контрагенты.СоздатьЭлемент();
				НовыйЭлемент.ЮрФизЛицо 				= Перечисления.ЮрФизЛицо.ФизЛицо;
				НовыйЭлемент.Наименование 			= Представление;
				НовыйЭлемент.НаименованиеПолное 	= Представление;
				
				НовыйЭлемент.Фамилия 				= Фамилия;
				НовыйЭлемент.Имя 					= Имя;
				НовыйЭлемент.Отчество 				= Отчество;
				
				НовыйЭлемент.ДатаРожденияКлиента 	= ?(ДатаРождения = Неопределено, Дата(1,1,1), ДатаРождения);
	
			Иначе			
				НовыйЭлемент = НовыйЭлемент.ПолучитьОбъект();
			КонецЕсли;
			
			НовыйЭлемент.Родитель 				= ВыборПапкиСправочника;  			
			НовыйЭлемент.ДатаРегистрации 		= ?(ЗначениеЗаполнено(НовыйЭлемент.ДатаРегистрации), НовыйЭлемент.ДатаРегистрации,
													?(ЗначениеЗаполнено(ДатаРегистрации), ДатаРегистрации, ТекущаяДатаСеанса()));
			
			//=======================================================СТАРЫЙ МЕХАНИЗМ ПОИСКА============================================================
			
			// ПустСсылка = Справочники.Контрагенты.ПустаяСсылка();
			// НовыйЭлемент = Справочники.Контрагенты.НайтиПоНаименованию(Представление, Истина); 
			//
			// Если НовыйЭлемент.Пустая() Тогда							
			//	НовыйЭлемент = Справочники.Контрагенты.СоздатьЭлемент();
			//	НовыйЭлемент.Родитель 			= ВыборПапкиСправочника;  
			//	НовыйЭлемент.ЮрФизЛицо 			= Перечисления.ЮрФизЛицо.ФизЛицо;
			//	НовыйЭлемент.Наименование 		= Представление;
			//	НовыйЭлемент.НаименованиеПолное = Представление;
			//	
			//	НовыйЭлемент.Фамилия 			= Фамилия;
			//	НовыйЭлемент.Имя 				= Имя;
			//	НовыйЭлемент.Отчество 			= Отчество;
			// Иначе         // проверим еще и по телефону
			//	Если ЗначениеЗаполнено(Телефон) Тогда 
			//		НовыйЭлемент = Справочники.Контрагенты.НайтиПоРеквизиту("Телефон", Телефон, , ВыборПапкиСправочника);
			//	КонецЕсли;
			//	Если НовыйЭлемент.Пустая() Тогда   // создаем
			//		НовыйЭлемент = Справочники.Контрагенты.СоздатьЭлемент();
			//		НовыйЭлемент.Родитель = ВыборПапкиСправочника;  
			//		НовыйЭлемент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо;
			//		НовыйЭлемент.Наименование = Представление;
			//		НовыйЭлемент.НаименованиеПолное = Представление;
			//		
			//		НовыйЭлемент.Фамилия = Фамилия;
			//		НовыйЭлемент.Имя = Имя;
			//		НовыйЭлемент.Отчество = Отчество;
			//	Иначе			
			//		НовыйЭлемент = НовыйЭлемент.ПолучитьОбъект();
			//	КонецЕсли;
			// КонецЕсли;
			
			Если НовыйЭлемент.СтруктурнаяЕдиница.Пустая() Тогда 
				НовыйЭлемент.СтруктурнаяЕдиница = ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(КодСинхронизации)
				И КодСинхронизации <> НовыйЭлемент.КодСинхронизации  Тогда
				НовыйЭлемент.КодСинхронизации = КодСинхронизации;
			КонецЕсли;
			
			НовыйЭлемент.Записать();
			
#Область _____________________________________________________ЗАПОЛНЕНИЕ_НОМЕРА_АМБУЛАТОРНОЙ_КАРТЫ____________________________________________________________



	ЭтоЧисло = Ложь;
	Уникальный = Ложь;
	
	Если ЗначениеЗаполнено(НомерАмбулаторнойКарты) Тогда 
		
		Если  ТипЗнч(НомерАмбулаторнойКарты) = Тип("Число") Тогда 
			ЭтоЧисло = Истина;
			НомерАмбулаторнойКарты_Число = НомерАмбулаторнойКарты;
		ИначеЕсли  ТипЗнч(НомерАмбулаторнойКарты) = Тип("Строка") Тогда 
			ЭтоЧисло = ПроверитьСтрокуНаЧисло(НомерАмбулаторнойКарты);
			Если ЭтоЧисло Тогда 
				НомерАмбулаторнойКарты_Число = Число(НомерАмбулаторнойКарты); 
			КонецЕсли;
		КонецЕсли;
		
		Если НовыйЭлемент.ТекущаяМедицинскаяКарта.Пустая() Тогда
			
			МедКарта = Справочники.МедицинскиеКарты.НайтиПоКоду(СокрЛП(НомерАмбулаторнойКарты));
			Если НЕ МедКарта.Пустая() Тогда
				Если МедКарта.ВладелецКарты <> НовыйЭлемент.Ссылка Тогда
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Мед. карта № "+СокрЛП(НомерАмбулаторнойКарты)+" принадлежит другому владельцу!");
				Иначе	
					НовыйЭлемент.ТекущаяМедицинскаяКарта = МедКарта;	
				КонецЕсли;	
			Иначе								
				МедКарта = Справочники.МедицинскиеКарты.СоздатьЭлемент();
				МедКарта.Код = НомерАмбулаторнойКарты;
				МедКарта.ДатаРегистрации = ТекущаяДата();
				Если ЗначениеЗаполнено(ВидМедицинскихКарт) Тогда 
					МедКарта.ВидМедицинскойКарты = ВидМедицинскихКарт;
				Иначе 	
					ВидыМедицинскихКарт = Справочники.ВидыМедицинскихКарт.Выбрать();
					Если ВидыМедицинскихКарт.Следующий() Тогда									
						МедКарта.ВидМедицинскойКарты = ВидыМедицинскихКарт.Ссылка;
					Иначе 
						ВидМедКарты = Справочники.ВидыМедицинскихКарт.СоздатьЭлемент();
						ВидМедКарты.Наименование = "Медицинская карта клиента";
						ВидМедКарты.ДлинаНомера = 12;
						ВидМедКарты.ПечатнаяФорма = Перечисления.ПечатныеФормыМедицинскихКарт.АмбулаторнаяКарта_043_У_А5;
						ВидМедКарты.Записать();
						МедКарта.ВидМедицинскойКарты = ВидМедКарты.Ссылка;
					КонецЕсли;
				КонецЕсли;
				МедКарта.ВладелецКарты = НовыйЭлемент.Ссылка;
				МедКарта.Наименование = МедКарта.ВидМедицинскойКарты.Наименование + " №" + МедКарта.Код + ", " + МедКарта.ВладелецКарты;
				МедКарта.Записать();
				
				МенеджерЗаписи = РегистрыСведений.МестонахождениеМедицинскихКарт.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.Период = ТекущаяДата();
				МенеджерЗаписи.МедицинскаяКарта = МедКарта.Ссылка;
				МенеджерЗаписи.Местоположение = Справочники.Местоположения.ВКлинике;
				МенеджерЗаписи.Записать();
				
				НовыйЭлемент.ТекущаяМедицинскаяКарта = МедКарта.Ссылка;
			КонецЕсли;							
			
			
		КонецЕсли;	
	КонецЕсли;					


#КонецОбласти
			

#Область ________________________________________________________________ЗАПОЛНЕНИЕ_ПОЛА______________________________________________________________________


			Если НЕ ЗначениеЗаполнено(НовыйЭлемент.ПолКлиента) Тогда 
				Если Пол <> "" И Пол <> Неопределено Тогда				
					НайденныйПол = ПолчитьТипПол(СокрЛП(Пол), Перечисления.ПолФизическогоЛица);				
					Если НайденныйПол <> Неопределено Тогда
						НовыйЭлемент.ПолКлиента = НайденныйПол
					Иначе
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неудалось привести к типу Пол. Строка: " + ИсходнаяСтрокаДанных);		
					КонецЕсли;
				Иначе 
					ПолКлиента = ОбщегоНазначенияКлиентСерверСтоматология.ОпределитьПолКлиента(Фамилия, Имя, Отчество);
					Если ПолКлиента = "Мужской" Тогда
						НовыйЭлемент.ПолКлиента = Перечисления.ПолФизическогоЛица.Мужской;
					ИначеЕсли ПолКлиента = "Женский" Тогда
						НовыйЭлемент.ПолКлиента = Перечисления.ПолФизическогоЛица.Женский;
					КонецЕсли;					
				КонецЕсли;			
			КонецЕсли;
			
#КонецОбласти


#Область ________________________________________________________ЗАПОЛНЕНИЕ_КОНТАКТНОЙ_ИНФОРМАЦИИ_____________________________________________________________

			Если ЗначениеЗаполнено(Телефон) Тогда
				Телефон = СтрЗаменить(СокрЛП(Телефон), "-", "");
			КонецЕсли;	
			
			Email = ВернутьЗначениеРевизита("Email", СтруктураРеквизитов);
			Если ЗначениеЗаполнено(Email) Тогда
				Если Найти(Email, "@") = 0 Тогда
					Email = "";
				КонецЕсли;
			КонецЕсли;
			
			Клиент_КонтактнаяИнформация = НовыйЭлемент.КонтактнаяИнформация;

			// Заполняем телефон клиента
			Представление = "";
			МассивТелефонов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Телефон, ",");
			Для Каждого Телефон Из МассивТелефонов Цикл
				
				Объект_XDTO_Телефон = ПолучитьСтруктуру_XDTO(СокрЛП(Телефон), Перечисления.ТипыКонтактнойИнформации.Телефон);
				
				// Найти в КИ существующий телефон
				Представление = Объект_XDTO_Телефон.Представление;
				
				НайденныеСтроки = Клиент_КонтактнаяИнформация.НайтиСтроки(Новый Структура("Представление, Тип", Представление, Перечисления.ТипыКонтактнойИнформации.Телефон));
				Если НайденныеСтроки.Количество() = 0 Тогда
					ЗаполнитьТелефон(НовыйЭлемент, Объект_XDTO_Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонКлиента);
				КонецЕсли;
				
			КонецЦикла;
			
			// Заполняем Email клиента
			МассивEmail = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Email, ",");
			Для Каждого Email Из МассивEmail Цикл
				Объект_XDTO_Email = ПолучитьСтруктуру_XDTO(СокрЛП(Email), Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
				
				// Найти в КИ существующий АдресЭлектроннойПочты
				Представление = Объект_XDTO_Email.Представление;
				
				НайденныеСтроки = Клиент_КонтактнаяИнформация.НайтиСтроки(Новый Структура("Представление, Тип", Представление, Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты));
				Если НайденныеСтроки.Количество() = 0 Тогда
					ЗаполнитьEmail(НовыйЭлемент, Объект_XDTO_Email, Справочники.ВидыКонтактнойИнформации.EmailКлиента);
				КонецЕсли;
				
			КонецЦикла;
			
			// Заполняем адрес клиента
			Если ЗначениеЗаполнено(Адрес) Тогда
				
				Объект_XDTO_Адрес = ПолучитьСтруктуру_XDTO(Адрес	, Перечисления.ТипыКонтактнойИнформации.Адрес);
				
				// Найти в КИ существующий Адрес
				Представление = Объект_XDTO_Адрес.Представление;
				
				ВсеАдресаКлиента = Клиент_КонтактнаяИнформация.НайтиСтроки(Новый Структура("Тип", Перечисления.ТипыКонтактнойИнформации.Адрес));
				Для каждого АдресКлиента Из ВсеАдресаКлиента Цикл
					Клиент_КонтактнаяИнформация.Удалить(АдресКлиента);
				КонецЦикла;					
	
				ЗаполнитьАдрес(НовыйЭлемент, Объект_XDTO_Адрес, Справочники.ВидыКонтактнойИнформации.АдресКлиента);
				
			КонецЕсли;

			//======================================================================================================================
			
			//// Заполняем данные по контактой информации
			// НовыйЭлемент.КонтактнаяИнформация.Очистить();
			//
			// НовыйЭлемент.Телефон 		= Телефон;			 
			// НовыйЭлемент.Комментарий 	= Комментарий;
			//
			// НоваяСтрок 					= НовыйЭлемент.КонтактнаяИнформация.Добавить();
			// НоваяСтрок.Тип 				= Перечисления.ТипыКонтактнойИнформации.Адрес;
			// НоваяСтрок.Вид 				= Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента;
			// НоваяСтрок.Представление 	= Адрес;
			//
			// НоваяСтрок 					= НовыйЭлемент.КонтактнаяИнформация.Добавить();
			// НоваяСтрок.Тип 				= Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
			// НоваяСтрок.Вид 				= Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
			// НоваяСтрок.АдресЭП 			= Email;
			// НоваяСтрок.Представление 	= Email;
			//// НоваяСтрок.ДоменноеИмяСервера=Email;
			//
			//
			// НоваяСтрок = НовыйЭлемент.КонтактнаяИнформация.Добавить();
			// НоваяСтрок.Тип 						= Перечисления.ТипыКонтактнойИнформации.Телефон;
			// НоваяСтрок.Вид 						= Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента;
			// НоваяСтрок.НомерТелефона 			= ?(СтруктураТелефонногоНомера = Неопределено, Телефон, СтруктураТелефонногоНомера.НомерТелефона);
			// НоваяСтрок.НомерТелефонаБезКодов 	= ?(СтруктураТелефонногоНомера = Неопределено, Телефон, СтруктураТелефонногоНомера.НомерТелефонаБезКодов);
			// НоваяСтрок.Представление 			= ?(СтруктураТелефонногоНомера = Неопределено, Телефон, СтруктураТелефонногоНомера.Представление);
			// НоваяСтрок.ЗначенияПолей 			= ?(СтруктураТелефонногоНомера = Неопределено, Телефон, СтруктураТелефонногоНомера.ЗначенияПолей);
				
#КонецОбласти


#Область _____________________________________________________СОЗДАНИЕ_ПОЛИСОВ_МЕДИЦИНСКОГО_СТРАХОВАНИЯ_______________________________________________________


			Если ЗначениеЗаполнено(НомерПолиса) Тогда 
	        	ВыборкаСтраховыхПолисов = Справочники.ПолисыМедицинскогоСтрахования.Выбрать( , , Новый Структура("Контрагент", НовыйЭлемент.Ссылка));
				ПолноеСовпадение = Ложь;
				Пока ВыборкаСтраховыхПолисов.Следующий() Цикл
					Если ВыборкаСтраховыхПолисов.СтраховаяКомпания = СтраховаяКомпания Тогда
						Если ВыборкаСтраховыхПолисов.НомерПолиса = СокрЛП(НомерПолиса) Тогда 
							Если ЗначениеЗаполнено(СерияПолиса) Тогда 
								Если ВыборкаСтраховыхПолисов.СерияПолиса = СокрЛП(СерияПолиса) Тогда								 
									ПолноеСовпадение = Истина;
									Прервать;
								КонецЕсли;
							Иначе 
								ПолноеСовпадение = Истина;
								Прервать;
							КонецЕсли;
						КонецЕсли;	
					КонецЕсли;	
				КонецЦикла;
				Если НЕ ПолноеСовпадение Тогда 
					// Создаем полис медицинского страхования
					НовыйОбъектПМС = Справочники.ПолисыМедицинскогоСтрахования.СоздатьЭлемент();
					НовыйОбъектПМС.Контрагент 			= НовыйЭлемент.Ссылка;
					НовыйОбъектПМС.ТипПолиса 			= ТипПолиса;
					НовыйОбъектПМС.СтраховаяКомпания 	= СтраховаяКомпания;
					НовыйОбъектПМС.СерияПолиса 			= ?(ЗначениеЗаполнено(СерияПолиса), СерияПолиса, "");
					НовыйОбъектПМС.НомерПолиса 			= НомерПолиса;
					НовыйОбъектПМС.ДанаНачала 			= ?(ЗначениеЗаполнено(НачалоДействияПолиса), ?(ПривестиКТипуДата(СокрЛП(НачалоДействияПолиса)) = Неопределено, Дата(1, 1, 1), ПривестиКТипуДата(СокрЛП(НачалоДействияПолиса))), Дата(1, 1, 1));
					НовыйОбъектПМС.ДатаОкончания 		= ?(ЗначениеЗаполнено(КонецДействияПолиса), ?(ПривестиКТипуДата(СокрЛП(КонецДействияПолиса)) = Неопределено, Дата(1, 1, 1), ПривестиКТипуДата(СокрЛП(КонецДействияПолиса))), Дата(1, 1, 1));  
					Если ЗначениеЗаполнено(ДоговорСтраховойКомпании) Тогда
					НовыйОбъектПМС.Договор = ДоговорСтраховойКомпании;
					КонецЕсли;
					Попытка
						НовыйОбъектПМС.Записать();
					Исключение
						ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Неудалось создать полис медицинского страхования для пациента: " + Строка(НовыйЭлемент.Ссылка));
					КонецПопытки;					
				КонецЕсли;	
			КонецЕсли; 

#КонецОбласти

			НовыйЭлемент.Записать();
			
#Область _____________________________________________________СОЗДАНИЕ_МЕТОК_______________________________________________________
			
			Если ЗначениеЗаполнено(Метки) Тогда
				
				МассивМетки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Метки, ",");
				
				ТабМетки = Новый ТаблицаЗначений;
				ТабМетки.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
				
				Для Каждого Метка Из МассивМетки Цикл
					СтрокаТабМетки = ТабМетки.Добавить();
					СтрокаТабМетки.Наименование = Лев(СокрЛП(Метка), 50);
				КонецЦикла;
				
				Запрос = Новый Запрос;
				Запрос.Текст = 
					"ВЫБРАТЬ
					|	ВЫРАЗИТЬ(Метки.Наименование КАК СТРОКА(50)) КАК Наименование
					|ПОМЕСТИТЬ ВТ_МеткиВсе
					|ИЗ
					|	&Метки КАК Метки
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ РАЗРЕШЕННЫЕ
					|	Метки.Ссылка КАК МеткаСсылка,
					|	ВТ_МеткиВсе.Наименование КАК Наименование
					|ИЗ
					|	ВТ_МеткиВсе КАК ВТ_МеткиВсе
					|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Метки КАК Метки
					|		ПО ВТ_МеткиВсе.Наименование = Метки.Наименование";
				
				Запрос.УстановитьПараметр("Метки", ТабМетки); 
				
				ТабРезультат = Запрос.Выполнить().Выгрузить();
				
				Для Каждого СтрокаТЗ Из ТабРезультат Цикл
					
					Если Не ЗначениеЗаполнено(СтрокаТЗ.МеткаСсылка) Тогда
						
						НоваяМетка = Справочники.Метки.СоздатьЭлемент();
						НоваяМетка.Наименование 			= СокрЛП(СтрокаТЗ.Наименование);
						НоваяМетка.ИспользоватьДляПациентов = Истина;
						НоваяМетка.ЦветМетки 				= "{""#"",9cd510c7-abfc-11d4-9434-004095e12fc7,2,{3,3,{-1}}}"; //{"#",9cd510c7-abfc-11d4-9434-004095e12fc7,2,{3,3,{-1}}}
						
						Попытка
							НоваяМетка.Записать();
							СтрокаТЗ.МеткаСсылка = НоваяМетка.Ссылка;
						Исключение
							ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Ошибка при записи элемента справочника Метки.';en='Error at records element directory Labels.'") + Символы.ПС + ОписаниеОшибки());	
							Продолжить;	
						КонецПопытки;
						
					КонецЕсли;
					
					ЗаписьМеткаКлиента 			= РегистрыСведений.МеткиКлиентов.СоздатьМенеджерЗаписи();
					ЗаписьМеткаКлиента.Автор 	= ПараметрыСеанса.ТекущийПользователь;
					ЗаписьМеткаКлиента.Активна 	= Истина;
					ЗаписьМеткаКлиента.Клиент 	= НовыйЭлемент.Ссылка;
					ЗаписьМеткаКлиента.Метка 	= СтрокаТЗ.МеткаСсылка;
					ЗаписьМеткаКлиента.Период	= ТекущаяДатаСеанса();
					ЗаписьМеткаКлиента.Записать(Истина);
	
				КонецЦикла;
				
			КонецЕсли;	

#КонецОбласти


#КонецОбласти
						
			
		КонецЕсли;	  
		
		СчетчикИмпортируемыхОбъектов = СчетчикИмпортируемыхОбъектов+1;
	Исключение
		ТекстИсключение = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Ошибка обработки по причине: " + ТекстИсключение);
	КонецПопытки;	  
	
КонецПроцедуры

&НаСервере
// Верент значение реквизита справочника из переданной структуры реквизитов
//
Функция ВернутьЗначениеРевизита(НаименованиеРеквизита, СтруктураРеквизитов)
	
	Возв = СокрЛП(СтруктураРеквизитов[СтрЗаменить(НаименованиеРеквизита," ","")]);   
	Если Возв = "" Тогда
		Возврат Неопределено;
	Иначе
		Возврат Возв;
	КонецЕсли;
	
КонецФункции  

&НаСервере
//
//
Функция ВернутьСтруктуруИнициалов(ФИО)

	ФИО = СокрЛП(ФИО);
	НомерПробела = Найти(ФИО, " ");
	Если НомерПробела = 0 Тогда 
		Фамилия = ФИО;
		Имя = "";
		Отчество = "";
	Иначе 
		Фамилия = СокрЛП(Лев(ФИО, НомерПробела));	
		ИмяОтчество = СокрЛП(Сред(ФИО, НомерПробела));	
		НомерПробела = Найти(ИмяОтчество, " ");
		Если НомерПробела = 0 Тогда 
			Имя = ИмяОтчество;
		    Отчество = "";
		Иначе 
			Имя = СокрЛП(Лев(ИмяОтчество, НомерПробела));
			Отчество = СокрЛП(Сред(ИмяОтчество, НомерПробела));			
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Новый Структура("Фамилия, Имя, Отчество", Фамилия, Имя, Отчество);
	
КонецФункции


//////////////////////////////////////////////////////////////////////////////////////////////
// Импорт из Excel таблицы

// Получить список данных из строки Excel
&НаКлиенте
Функция ИзСтрокиExcel(ExcelЛист, НомерСтроки, КолСтолбцов)
	
	СписокПолей = Новый СписокЗначений;
	
	Для Столбец = 1 По КолСтолбцов Цикл
		СписокПолей.Добавить(ExcelЛист.Cells(НомерСтроки,Столбец).Text, ExcelЛист.Cells(НомерСтроки,Столбец).Text);
	КонецЦикла;
	
	Возврат СписокПолей;
	
КонецФункции

// Получаем наименования полей из первой строки 
&НаКлиенте
Функция ПолчитьПоляИзExcel()
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлИмпорта);
		// Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = Excel.Sheets(1);
	Исключение
		ТекстИсключение=ОписаниеОшибки();
		ПоказатьПредупреждение(,"Немогу подключиться к файлу по причине: "+ТекстИсключение);
		Возврат неопределено;		 
	КонецПопытки;
	
	ColumnsCount = Excel.Cells.CurrentRegion.Columns.Count;		
	СписокКолонокФайла=ИзСтрокиExcel(ExcelЛист,1,ColumnsCount);
	
	Excel.WorkBooks.Close();
	Excel = 0;
	
	возврат СписокКолонокФайла;
	
КонецФункции

&НаКлиенте
// Загрузка реквизитов справочника из таблицы Excel
// 
Функция ЗагрузитьИзExcel()
	
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ФайлИмпорта);
		// Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = Excel.Sheets(1);
	Исключение
		ТекстИсключение = ОписаниеОшибки();
		ПоказатьПредупреждение(,"Немогу подключиться к файлу по причине: "+ТекстИсключение);
		Возврат неопределено;		 
	КонецПопытки;
	
	
	КолСтрок = Excel.Cells.CurrentRegion.Rows.Count;
	КолСтолбцов = Excel.Cells.CurrentRegion.Columns.Count;
	
	ИндексСтроки = 2;
	Коэфициент = 100 / КолСтрок;
	Коэф = Коэфициент;
	Если ЗагружаемыйСправочник = "Номенклатура" Тогда 
		ТекстСообщения = "Загрузка номенклатуры";
	Иначе 
		ТекстСообщения = "Загрузка клиентов";
	КонецЕсли;
	
	Пока ИндексСтроки <= КолСтрок Цикл
		СписокДанных = ИзСтрокиExcel(ExcelЛист, ИндексСтроки, КолСтолбцов);
		СтруктураРеквизитов = Новый Структура();
		
		Индекс = 0;
		Пока Индекс < Объект.ТаблицаСоответсвийПолей.Количество() Цикл
			
			Строка = Объект.ТаблицаСоответсвийПолей[Индекс];
			Реквизит = СтрЗаменить(Строка.РеквизитСправочника, " ", "");
			Реквизит = СтрЗаменить(Реквизит, "*", "");	
			
			Если Строка.КолонкаФайла <> "" Тогда
				Идентификатор = СписокКолонокФайла.НайтиПоЗначению(Строка.КолонкаФайла).ПолучитьИдентификатор();
				СтруктураРеквизитов.Вставить(Реквизит, СписокДанных[Идентификатор].Значение);
			Иначе   
				СтруктураРеквизитов.Вставить(Реквизит, "");
			КонецЕсли;	   
			
			Индекс = Индекс + 1;
			
		КонецЦикла;
		Если ЗагружаемыйСправочник = "Номенклатура" Тогда 
			Состояние(ТекстСообщения, ?(Цел(Коэф) < 1, 1, Цел(Коэф)), "Получение " + Строка(СтруктураРеквизитов.Наименование) + "...", БиблиотекаКартинок.Информация32); 			
		Иначе 
			Состояние(ТекстСообщения, ?(Цел(Коэф) < 1, 1, Цел(Коэф)), "Получение " + Строка(СтруктураРеквизитов.Фамилия) + " " + Строка(СтруктураРеквизитов.Имя) + " " + Строка(СтруктураРеквизитов.Отчество) + "...", БиблиотекаКартинок.Информация32); 
			// Приведем телефонный номер к установленному формату
			СписокПолей = Новый СписокЗначений;
			УправлениеКонтактнойИнформациейСтоматология.ПреобразоватьНомерТелефона(?(СтруктураРеквизитов.Свойство("Телефон"), СтруктураРеквизитов.Телефон, ""), СписокПолей);			
			СтруктураТелефонногоНомера = ЗаполнитьСтруктуруТелефонногоНомера(?(СтруктураРеквизитов.Свойство("Телефон"), СтруктураРеквизитов.Телефон, ""), СписокПолей);
		КонецЕсли;		
		
		ЗаполнитьРеквизитыСправочника(СтруктураРеквизитов, Формат(СписокДанных), ВидМедицинскихКарт, СтруктураТелефонногоНомера);
		Коэф = Коэф + Коэфициент;
		ИндексСтроки = ИндексСтроки + 1;
	КонецЦикла;		
	
	Excel.WorkBooks.Close();
	Excel = 0;
	
	Возврат Истина;
	
КонецФункции // ЗагрузитьИзExcel()


////////////////////////////////////////////////////////////////////////////////////
// Импорт из текстового файла

// Работа с текстовым файлом
&НаКлиенте
Функция ПолучитьПоляФайла()
	
	Если ТипФайлаИмпорта="TEXT" Тогда
		
		// Читаем первую строку файла содержащую наименования колонок
		Текст = Новый ЧтениеТекста(ФайлИмпорта);
		Стр = Текст.ПрочитатьСтроку();
		Если Стр=Неопределено Тогда
			
			ПоказатьПредупреждение(,"Файл импорта пуст ! импорт не возможен !");
			Возврат Ложь;
		КонецЕсли;	 
		
		СписокКолонокФайла = СтрокаВСписок(Стр, СимволРазделитель);
	Иначе
		
		СписокКолонокФайла = ПолчитьПоляИзExcel();
	КонецЕсли;
	
	Если СписокКолонокФайла.Количество() = 0 Тогда 
		
		ПоказатьПредупреждение(,"Файл импорта пуст ! импорт не возможен !");
		Возврат Ложь;
	Иначе
		
		Возврат Истина;	   
	КонецЕсли; 
	
КонецФункции

// Получить строку реквизитов из текстового файла
&НаКлиенте
Функция ЗагрузитьИзТекста()
	
	Попытка
		
		// Выводим оповещение, т.к. показать прогресс в случае с текстовым файлом затруднительно
		ПоказатьОповещениеПользователя("Выполнение импорта данных", , "Производится загрузка данных из файла. Это может занять некоторое время.", БиблиотекаКартинок.Информация32);
		
		Текст = Новый ЧтениеТекста(ФайлИмпорта);
		Стр = Текст.ПрочитатьСтроку();
		Стр = Текст.ПрочитатьСтроку();
		СтруктураРеквизитов=Новый Структура();
		
		Пока Стр <> Неопределено Цикл
			
			СписокДанных = СтрокаВСписок(Стр, СимволРазделитель);
			Индекс = 0;
			Пока Индекс< Объект.ТаблицаСоответсвийПолей.Количество() Цикл
				
				Строка=Объект.ТаблицаСоответсвийПолей[Индекс];
				Реквизит = СтрЗаменить(Строка.РеквизитСправочника," ","");
				Реквизит = СтрЗаменить(Реквизит,"*","");	
				
				Если Строка.КолонкаФайла <> "" Тогда
					Идентификатор = СписокКолонокФайла.НайтиПоЗначению(Строка.КолонкаФайла).ПолучитьИдентификатор();
					СтруктураРеквизитов.Вставить(Реквизит, СписокДанных[Идентификатор].Значение);
				Иначе   
					СтруктураРеквизитов.Вставить(Реквизит, "");
				КонецЕсли;	   
				
				Индекс = Индекс + 1;
			КонецЦикла;		
			
			ЗаполнитьРеквизитыСправочника(СтруктураРеквизитов, Стр, ВидМедицинскихКарт);
			Стр = Текст.ПрочитатьСтроку();
			
		КонецЦикла;
	Исключение 
		ТекстИсключение=ОписаниеОшибки();
		ПоказатьПредупреждение(,"Ошибка обработки файла: "+ТекстИсключение);
		Возврат неопределено;	
	КонецПопытки;	
	
	Возврат Истина;
	
КонецФункции

//////////////////////////////////////////////////////////////////////////////
// Процесс импорта

&НаКлиенте
//
//
Процедура СтартИмпорта(Команда)
	
	Если ЗагружаемыйСправочник = "" Тогда
		ПоказатьПредупреждение(,"Укажите заполняемый справочник");
		Возврат;
	КонецЕсли;
	
	Если  ВыборПапкиСправочника.Пустая() = Истина Тогда
		ПоказатьПредупреждение(,"Укажите папку справочника");
		Возврат;
	КонецЕсли;	  
	
	Если ЗагружаемыйСправочник = "Номенклатура" И НомеклатураТипЦен.Пустая() = Истина Тогда
		ПоказатьПредупреждение(,"Укажите тип цен");
		Возврат;
	КонецЕсли;	
	
	Если ЗагружаемыйСправочник = "Номенклатура" Тогда
		Если НЕ ЗначениеЗаполнено(ПоискПоТипу) Тогда 
			ПоказатьПредупреждение(,"Не указан тип поиска номенклатуры!");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗагружаемыйСправочник = "Номенклатура" Тогда
		Если ПоискПоТипу = 1 Тогда
			Если НЕ ЗаполненыРеквизитыДляНоменклатуры("Наименование") Тогда 
				ПоказатьПредупреждение(,"Не указано наименование!");
				Возврат;
			КонецЕсли;	
		ИначеЕсли ПоискПоТипу = 3 Тогда
			Если НЕ ЗаполненыРеквизитыДляНоменклатуры("Артикул") Тогда 			
				ПоказатьПредупреждение(,"Не указан артикул!");
				Возврат;
			КонецЕсли;				
		КонецЕсли;	
	КонецЕсли;
	
	Если ЗагружаемыйСправочник = "Пациенты" Тогда
		Если НЕ ЗначениеЗаполнено(СтраховаяКомпания) Тогда 
			Если ЗаполненыРеквизитыДляПолиса() Тогда 
				ПоказатьПредупреждение(,"Укажите страховую компанию");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТипПолиса) Тогда 
			Если ЗаполненыРеквизитыДляПолиса() Тогда 
				ПоказатьПредупреждение(,"Укажите тип полиса");
				Возврат;
			КонецЕсли;
		КонецЕсли;
		// Если НЕ ЗначениеЗаполнено(ДоговорСтраховойКомпании) Тогда 
		//	Если ЗаполненыРеквизитыДляПолиса() Тогда 
		//		Предупреждение("Укажите договор страхования");
		//		Возврат;
		//	КонецЕсли;
		// КонецЕсли;
	КонецЕсли;
	
	Если ФлагРазрешенияИмпорта=Истина Тогда
		СчетчикИмпортируемыхОбъектов=0;
		результат = Ложь;
		Если ТипФайлаИмпорта = "TEXT" Тогда
			
			результат = ЗагрузитьИзТекста();
		Иначе
			результат = ЗагрузитьИзExcel();
		КонецЕсли;	
		
		Если результат=Истина Тогда	
			
			ПоказатьПредупреждение(,"Операция импортирования завершена успешно. Загружено объектов: "+Формат(СчетчикИмпортируемыхОбъектов, "ЧН=0"));
		КонецЕсли;	 
	Иначе
		
		ПоказатьПредупреждение(,"Операция не возможна в связи с неверными настройками импортирования");
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
//
//
Функция ЗаполненыРеквизитыДляНоменклатуры(ПроверяемыйРеквизит)
	
	РеквизитДляНоменклатурыЗаполнен = Ложь;	
	
	ТаблицаСоответсвийПолей_ТаблицаЗначений = Объект.ТаблицаСоответсвийПолей.Выгрузить();
	СтрокаТЧ = ТаблицаСоответсвийПолей_ТаблицаЗначений.Найти(ПроверяемыйРеквизит, "РеквизитСправочника");
	Если СтрокаТЧ <> Неопределено Тогда 
		Если ЗначениеЗаполнено(СтрокаТЧ.КолонкаФайла) Тогда 
			РеквизитДляНоменклатурыЗаполнен = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат РеквизитДляНоменклатурыЗаполнен;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////////
// Дополнительные методы обработки


&НаСервере
// Функция разбивает строку на подстроки в списке
//
Функция СтрокаВСписок(Строка,Разделитель = ",")
	
	ПоследнийЭлементПуст=Ложь;
	Стр=Строка;
	Список = Новый СписокЗначений;
	Длина = СтрДлина(Разделитель)-1;
	Пока СтрДлина(Стр)>0 Цикл
		РазделительКоличество = Найти(Стр,Разделитель);
		Если РазделительКоличество > 0 Тогда
			ВрСтр = СокрЛП(Лев(Стр,РазделительКоличество - 1));
			Стр = СокрЛП(Прав(Стр,СтрДлина(Стр) - РазделительКоличество - Длина));
			Если СтрДлина(Стр)=0 Тогда
				ПоследнийЭлементПуст=Истина;
			КонецЕсли;
		Иначе
			// последняя
			ВрСтр = СокрЛП(Стр);
			Стр = "";
		КонецЕсли;
		
		Если (Лев(ВрСтр,1) = """") И (Прав(ВрСтр,1) = """") Тогда
			ВрСтр = Сред(ВрСтр,2,СтрДлина(ВрСтр)-2);
		КонецЕсли;
		
		Список.Добавить(ВрСтр);
	КонецЦикла;
	
	Если ПоследнийЭлементПуст Тогда
		Список.Добавить("");
	КонецЕсли;	  
	
	Возврат(Список)
КонецФункции

&НаСервере
// Функция приводит текстовый формат представления даты к типу дата, поддерживаемые маски ####.##.##., ##.##.####
//
Функция ПривестиКТипуДата(СтрПредст)
	
	Если СтрДлина(СтрПредст) < 8 Тогда
		Возврат Неопределено;	
	КонецЕсли;	
	Попытка 
		
		СписокЗн = СтрокаВСписок(СтрПредст,".");
		
		Если СписокЗн.Количество() = 0 Тогда
			Возврат Неопределено;
		Иначе
			
			Если СтрДлина(СписокЗн[0]) > 2 Тогда
				Возврат Дата(СписокЗн[0] + Формат(СписокЗн[1], "ЧЦ=2; ЧВН=") + Формат(СписокЗн[2], "ЧЦ=2; ЧВН="));
			Иначе
				Возврат Дата(Формат(СписокЗн[2], "ЧЦ=2; ЧВН=") + Формат(СписокЗн[1], "ЧЦ=2; ЧВН=") + СписокЗн[0]);
			КонецЕсли;
		КонецЕсли;	
	Исключение
		Возврат Неопределено;
	КонецПопытки;	  
	
КонецФункции	

// Функция ищет значение перечисления по передеанной строке(поддержка поиска по подстрокам)
//
&НаСервере
Функция ПолчитьТипПол(СтрПредст,ПеречислениеОбъект)
	
	СтрПредст=СтрЗаменить(СтрПредст,".","");
	Индекс=0;
	Пока Индекс<ПеречислениеОбъект.Количество() Цикл
		
		Зн=Формат(ПеречислениеОбъект[Индекс]);
		Если Найти(НРег(Зн),НРег(СтрПредст))<>0 Тогда
			Возврат ПеречислениеОбъект[Индекс];
		КонецЕсли;	
		
		Индекс=Индекс+1;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции	  

&НаСервере
// Функция возвращает Истина, если в строке содержится только число
// и Ложь, если это не так
//
Функция ПроверитьСтрокуНаЧисло(НашаСтрока)
	
	Если СтрДлина(СокрЛП(НашаСтрока)) <> 0 Тогда 
		ЕстьЦифры = Ложь;
		ЕстьБуквы = Ложь;
		Для К = 1 По СтрДлина(СокрЛП(НашаСтрока)) Цикл 
			Если Найти("0123456789", Сред(НашаСтрока, К, 1)) <> 0 Тогда 
				ЕстьЦифры = Истина;
			Иначе 
				ЕстьБуквы = Истина;
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;		
	
	Если ЕстьЦифры И ЕстьБуквы Тогда 
		Возврат Ложь;
	ИначеЕсли ЕстьЦифры И НЕ ЕстьБуквы Тогда 
		Возврат Истина;
	ИначеЕсли НЕ ЕстьЦифры И ЕстьБуквы Тогда 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
//
//
Функция ЗаполнитьСтруктуруТелефонногоНомера(Телефон, СписокПолей)
	
	СтруктураТелефонногоНомера = Новый Структура;
	СтруктураТелефонногоНомера.Вставить("Представление");
	СтруктураТелефонногоНомера.Вставить("ЗначенияПолей");
	СтруктураТелефонногоНомера.Вставить("НомерТелефона");
	СтруктураТелефонногоНомера.Вставить("НомерТелефонаБезКодов");
	
	Для Каждого ЭлементСписка Из СписокПолей Цикл 
		Если ЭлементСписка.Представление = "КодСтраны" Тогда 
			ЗначенияПолейКодСтраны = ?(ЗначениеЗаполнено(ЭлементСписка.Значение), ЭлементСписка.Представление + "=" + Строка(ЭлементСписка.Значение), "");
			КодСтраны = Строка(ЭлементСписка.Значение); 
		КонецЕсли;
		Если ЭлементСписка.Представление = "КодГорода" Тогда 
			ЗначенияПолейКодГорода = ?(ЗначениеЗаполнено(ЭлементСписка.Значение), ЭлементСписка.Представление + "=" + Строка(ЭлементСписка.Значение), "");
			КодГорода = Строка(ЭлементСписка.Значение);
		КонецЕсли;
		Если ЭлементСписка.Представление = "НомерТелефона" Тогда
			ЗначенияПолейНомерТелефона = ?(ЗначениеЗаполнено(ЭлементСписка.Значение), ЭлементСписка.Представление + "=" + Строка(ЭлементСписка.Значение), "");
			НомерТелефона = Строка(ЭлементСписка.Значение);
		КонецЕсли;
		Если ЭлементСписка.Представление = "Добавочный" Тогда
			ЗначенияПолейДобавочный = ?(ЗначениеЗаполнено(ЭлементСписка.Значение), ЭлементСписка.Представление + "=" + Строка(ЭлементСписка.Значение), "");
		КонецЕсли;	
		Если ЭлементСписка.Представление = "Комментарий" Тогда
			ЗначенияПолейКомментарий = ?(ЗначениеЗаполнено(ЭлементСписка.Значение), ЭлементСписка.Представление + "=" + Строка(ЭлементСписка.Значение), "");
		КонецЕсли;	
		
	КонецЦикла;
	
	СтруктураТелефонногоНомера.Представление 			= ""+Телефон;	
	СтруктураТелефонногоНомера.ЗначенияПолей 			= ""+ЗначенияПолейКодСтраны + Символы.ПС + ЗначенияПолейКодГорода + Символы.ПС + ЗначенияПолейНомерТелефона + Символы.ПС + ЗначенияПолейДобавочный + Символы.ПС + ЗначенияПолейКомментарий;
	СтруктураТелефонногоНомера.НомерТелефона 			= ""+КодСтраны + КодГорода + НомерТелефона;
	СтруктураТелефонногоНомера.НомерТелефонаБезКодов 	= ""+НомерТелефона;
	
	Возврат СтруктураТелефонногоНомера;
	
КонецФункции

&НаСервере
//
//
Функция ЗаполненыРеквизитыДляПолиса()
	
	РеквизитДляПолисаЗаполнен = Ложь;
	
	МассивПроверяемыхРеквизитовСправочника = Новый Массив;
	МассивПроверяемыхРеквизитовСправочника.Добавить("Серия полиса");
	МассивПроверяемыхРеквизитовСправочника.Добавить("Номер полиса");
	МассивПроверяемыхРеквизитовСправочника.Добавить("Начало действия полиса");
	МассивПроверяемыхРеквизитовСправочника.Добавить("Конец действия полиса");
	
	ТаблицаСоответсвийПолей_ТаблицаЗначений = Объект.ТаблицаСоответсвийПолей.Выгрузить();
	
	Для Каждого ЭлементМассива Из МассивПроверяемыхРеквизитовСправочника Цикл 
		
		СтрокаТЧ = ТаблицаСоответсвийПолей_ТаблицаЗначений.Найти(ЭлементМассива, "РеквизитСправочника");
		Если СтрокаТЧ <> Неопределено Тогда 
			Если ЗначениеЗаполнено(СтрокаТЧ.КолонкаФайла) Тогда 
				РеквизитДляПолисаЗаполнен = Истина;
				Прервать;
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат РеквизитДляПолисаЗаполнен;
	
КонецФункции

&НаСервере
//
//
Функция СравнитьТелефоны(Телефон1, Телефон2) 
	
	Телефон1 = СокрЛП(Телефон1);	
	Телефон2 = СокрЛП(Телефон2);	
	
	ПозицияЗапятой1 = Найти(Телефон1, ",");
	ПозицияЗапятой2 = Найти(Телефон2, ",");
	
	Если ПозицияЗапятой1 <> 0 Тогда 
		Телефон1 = Лев(Телефон1, ПозицияЗапятой1);
	КонецЕсли;
	
	Если ПозицияЗапятой2 <> 0 Тогда 
		Телефон2 = Лев(Телефон2, ПозицияЗапятой2);
	КонецЕсли;
	
	НомерТелефона1_ТолькоЦифры = ВернутьТелефонТолькоЦифрами(Телефон1);
	НомерТелефона2_ТолькоЦифры = ВернутьТелефонТолькоЦифрами(Телефон2);
	
	
	Если ?(Константы.СтранаУчета.Получить().Пустая(), 0, Константы.СтранаУчета.Получить().Код) = "804" Тогда 
		Если СтрДлина(НомерТелефона1_ТолькоЦифры) = 11 Тогда
			Если Сред(НомерТелефона1_ТолькоЦифры, 2, 1) = "0" Тогда 
				НомерТелефона1_ТолькоЦифры = Сред(НомерТелефона1_ТолькоЦифры, 2, 10);
			КонецЕсли;
		ИначеЕсли СтрДлина(НомерТелефона1_ТолькоЦифры) = 12 Тогда
			Если Сред(НомерТелефона1_ТолькоЦифры, 1, 2) = "38" Тогда 
				НомерТелефона1_ТолькоЦифры = Сред(НомерТелефона1_ТолькоЦифры, 3, 10);
			КонецЕсли;	
		КонецЕсли;		
		Если СтрДлина(НомерТелефона2_ТолькоЦифры) = 11 Тогда
			Если Сред(НомерТелефона2_ТолькоЦифры, 2, 1) = "0" Тогда 
				НомерТелефона2_ТолькоЦифры = Сред(НомерТелефона2_ТолькоЦифры, 2, 10);
			КонецЕсли;
		ИначеЕсли СтрДлина(НомерТелефона2_ТолькоЦифры) = 12 Тогда
			Если Сред(НомерТелефона2_ТолькоЦифры, 1, 2) = "38" Тогда 
				НомерТелефона2_ТолькоЦифры = Сред(НомерТелефона2_ТолькоЦифры, 3, 10);
			КонецЕсли;	
		КонецЕсли;		
	Иначе 	
		Если СтрДлина(НомерТелефона1_ТолькоЦифры) = 11 Тогда
			Если Лев(НомерТелефона1_ТолькоЦифры, 1) = "7" ИЛИ Лев(НомерТелефона1_ТолькоЦифры, 1) = "8" Тогда 
				НомерТелефона1_ТолькоЦифры = Сред(НомерТелефона1_ТолькоЦифры, 2, 10);
			КонецЕсли;		
		КонецЕсли;
		Если СтрДлина(НомерТелефона2_ТолькоЦифры) = 11 Тогда
			Если Лев(НомерТелефона2_ТолькоЦифры, 1) = "7" ИЛИ Лев(НомерТелефона2_ТолькоЦифры, 1) = "8" Тогда 
				НомерТелефона2_ТолькоЦифры = Сред(НомерТелефона2_ТолькоЦифры, 2, 10);
			КонецЕсли;		
		КонецЕсли;		
	КонецЕсли;
	
	Если НомерТелефона1_ТолькоЦифры = НомерТелефона2_ТолькоЦифры Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаСервере
//
//
Функция ВернутьТелефонТолькоЦифрами(Строка) 
	
  СтрокаЧисел = "";

   Для Индекс = 1 По СтрДлина(Строка) Цикл
   
      Символ = Сред(Строка, Индекс, 1); // Перебираем все сиволы из нашей строки

      Если КодСимвола(Символ) >= 48 И КодСимвола(Символ) <= 57 Тогда // Код нуля - 48, код 9-ки - 57
         СтрокаЧисел = СтрокаЧисел + Символ;
      КонецЕсли;
   
   КонецЦикла;

   Возврат СтрокаЧисел;	
	
	
КонецФункции

// Функция - Получить структуру XDTO телефона
//
// Параметры:
//  Телефон	 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ПолучитьСтруктуру_XDTO(Представление, ТипКИ)
	
	Если НЕ ЗначениеЗаполнено(Представление) Тогда
		Возврат Неопределено;
	КонецЕсли;	
	
	Объект_XDTO = УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOПоПредставлению(Представление, ТипКИ);
	Если ТипКИ = Перечисления.ТипыКонтактнойИнформации.Телефон Тогда 
		Если НЕ ЗначениеЗаполнено(Объект_XDTO.Состав.Номер) Тогда 
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
	Возврат Объект_XDTO;
	
КонецФункции

// Процедура - Заполнить телефон 
//
// Параметры:
//  НовыйЭлемент		 - 	 - 
//  Объект_XDTO_Телефон	 - 	 - 
//
Процедура ЗаполнитьТелефон(НовыйЭлемент, Знач Объект_XDTO_Телефон, Знач ВидКИ)
	
	Если Объект_XDTO_Телефон = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НоваяСтрока 						= НовыйЭлемент.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Тип 					= Перечисления.ТипыКонтактнойИнформации.Телефон;
	НоваяСтрока.Вид 					= ВидКИ;
	НоваяСтрока.НомерТелефона 			= СокрЛП(Объект_XDTO_Телефон.Состав.КодСтраны) + СокрЛП(Объект_XDTO_Телефон.Состав.КодГорода) + СокрЛП(Объект_XDTO_Телефон.Состав.Номер);
	НоваяСтрока.НомерТелефонаБезКодов 	= Объект_XDTO_Телефон.Состав.Номер;
	
	НоваяСтрока.ЗначенияПолей 			= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияXMLПоПредставлению(Объект_XDTO_Телефон.Представление,ВидКИ);
	НоваяСтрока.Значение 				= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Объект_XDTO_Телефон.Представление, ВидКИ);

	НоваяСтрока.Представление			= Объект_XDTO_Телефон.Представление;
	// НоваяСтрока.ЗначенияПолей			= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Телефон);
	
КонецПроцедуры

// Процедура - Заполнить email 
//
// Параметры:
//  НовыйЭлемент		 - 	 - 
//  Объект_XDTO_Email	 - 	 - 
//
Процедура ЗаполнитьEmail(НовыйЭлемент, Знач Объект_XDTO_Email, Знач ВидКИ)
	
	Если Объект_XDTO_Email = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НоваяСтрока 				= НовыйЭлемент.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Тип 			= Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
	НоваяСтрока.Вид 			= ВидКИ;
	НоваяСтрока.АдресЭП 		= Объект_XDTO_Email.Представление;
	НоваяСтрока.ЗначенияПолей 	= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Email);
	НоваяСтрока.Значение 		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Объект_XDTO_Email.Представление, ВидКИ);
	НоваяСтрока.Представление 	= НоваяСтрока.АдресЭП;
	
КонецПроцедуры

// Процедура - Заполнить адрес
//
// Параметры:
//  НовыйЭлемент		 - 	 - 
//  Объект_XDTO_Адрес	 - 	 - 
//  ВидКИ				 - 	 - 
//
Процедура ЗаполнитьАдрес(НовыйЭлемент, Знач Объект_XDTO_Адрес, Знач ВидКИ)
	
	Если Объект_XDTO_Адрес = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	НоваяСтрока 				= НовыйЭлемент.КонтактнаяИнформация.Добавить();
	НоваяСтрока.Тип 			= Перечисления.ТипыКонтактнойИнформации.Адрес;
	НоваяСтрока.Вид 			= ВидКИ;
	НоваяСтрока.Страна 			= ?(Объект_XDTO_Адрес.Состав.Страна = Неопределено, "", Объект_XDTO_Адрес.Состав.Страна);
	НоваяСтрока.Регион 			= ?(Объект_XDTO_Адрес.Состав.Состав.СубъектРФ = Неопределено, "", Объект_XDTO_Адрес.Состав.Состав.СубъектРФ);
	НоваяСтрока.Город 			= ?(Объект_XDTO_Адрес.Состав.Состав.Город = Неопределено, "", Объект_XDTO_Адрес.Состав.Состав.Город);
	НоваяСтрока.ЗначенияПолей 	= УправлениеКонтактнойИнформациейСлужебный.КонтактнаяИнформацияXDTOВXML(Объект_XDTO_Адрес);
	НоваяСтрока.Значение 		= УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(Объект_XDTO_Адрес.Представление, ВидКИ);
	НоваяСтрока.Представление 	= Объект_XDTO_Адрес.Представление;
	
КонецПроцедуры
